In [29]:
import pandas as pd

In [30]:
data1={"a":[1,2,3,4],
       "b":[11,26,35,42],
       "c":[12,25,34,44],
       "d":[13,24,35,43]    
}

In [31]:
df=pd.DataFrame(data1)

In [32]:
df

   a   b   c   d
0  1  11  12  13
1  2  26  25  24
2  3  35  34  35
3  4  42  44  43

In [33]:
df1=pd.DataFrame(data1,index=['a','b','c','d'])

In [34]:
df1.reindex(['b','c','d','a'])

   a   b   c   d
b  2  26  25  24
c  3  35  34  35
d  4  42  44  43
a  1  11  12  13

In [35]:
df1

   a   b   c   d
a  1  11  12  13
b  2  26  25  24
c  3  35  34  35
d  4  42  44  43

In [36]:
df1.reindex(['b','c','d','a'])

   a   b   c   d
b  2  26  25  24
c  3  35  34  35
d  4  42  44  43
a  1  11  12  13

In [37]:
df1.iterrows()

In [38]:
for i in df1.iterrows():
    print(i)

('a', a     1
b    11
c    12
d    13
Name: a, dtype: int64)
('b', a     2
b    26
c    25
d    24
Name: b, dtype: int64)
('c', a     3
b    35
c    34
d    35
Name: c, dtype: int64)
('d', a     4
b    42
c    44
d    43
Name: d, dtype: int64)

In [39]:
df1.iterrows()

In [40]:
for i in df1.iterrows():
    print(i)

('a', a     1
b    11
c    12
d    13
Name: a, dtype: int64)
('b', a     2
b    26
c    25
d    24
Name: b, dtype: int64)
('c', a     3
b    35
c    34
d    35
Name: c, dtype: int64)
('d', a     4
b    42
c    44
d    43
Name: d, dtype: int64)

In [41]:
df1

   a   b   c   d
a  1  11  12  13
b  2  26  25  24
c  3  35  34  35
d  4  42  44  43

In [42]:
df

   a   b   c   d
0  1  11  12  13
1  2  26  25  24
2  3  35  34  35
3  4  42  44  43

In [43]:
# sum one column
def test(x):
    return x.sum()
df.apply(test , axis=0)

a     10
b    114
c    115
d    115
dtype: int64

In [44]:
df2=df[['a','b']]

##

In [45]:
df2

   a   b
0  1  11
1  2  26
2  3  35
3  4  42

In [46]:
df2.applymap(lambda x:x**2)

    a     b
0   1   121
1   4   676
2   9  1225
3  16  1764

In [47]:
df1

   a   b   c   d
a  1  11  12  13
b  2  26  25  24
c  3  35  34  35
d  4  42  44  43

In [48]:
data2={"a":[1,2,3,4],
       "b":[11,26,35,42],
       "c":[12,25,34,44],
       "d":["shiv","mahakal","om","shivay"]    
}

In [49]:
df3=pd.DataFrame(data2)

In [50]:
df3

   a   b   c        d
0  1  11  12     shiv
1  2  26  25  mahakal
2  3  35  34       om
3  4  42  44   shivay

In [51]:
df3.sort_values("d")

   a   b   c        d
1  2  26  25  mahakal
2  3  35  34       om
0  1  11  12     shiv
3  4  42  44   shivay

In [52]:
df3.sort_values("c")

   a   b   c        d
0  1  11  12     shiv
1  2  26  25  mahakal
2  3  35  34       om
3  4  42  44   shivay

In [53]:
df3.sort_values("b")

   a   b   c        d
0  1  11  12     shiv
1  2  26  25  mahakal
2  3  35  34       om
3  4  42  44   shivay

In [54]:
df3.sort_values("a")

   a   b   c        d
0  1  11  12     shiv
1  2  26  25  mahakal
2  3  35  34       om
3  4  42  44   shivay

In [55]:
df3.sort_index()

   a   b   c        d
0  1  11  12     shiv
1  2  26  25  mahakal
2  3  35  34       om
3  4  42  44   shivay

In [56]:
df3.sort_index(ascending=False)

   a   b   c        d
3  4  42  44   shivay
2  3  35  34       om
1  2  26  25  mahakal
0  1  11  12     shiv

In [69]:
dict={"disc":["Your career goals, personal interests, and how far you want to take your education will all influence your decision of which field is best for you. Computer science takes a broader approach to computing, requiring the acquisition of a diverse set of skills. This gives it one great advantage over a data science degree: a broader range of career possibilities. A data science degree, on the other hand, can be a definite advantage for those engaged in data science careers.  "]}

In [63]:
df4=pd.DataFrame(dict)

In [64]:
df4

                                                disc
0  Your career goals, personal interests, and how...

In [67]:
pd.set_option("display.max_colwidth",500)
df4

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          disc
0  Your career goals, personal interests, and how far you want to take your education will all influence your decision of which field is best for you. Computer science takes a broader approach to computing, requiring the acquisition of a diverse set of skills. This gives it one great advantage over a data science degree: a broader range of career possibilities. A data science degree, on the other hand, can be a definite advantage for those engaged in data science careers.

In [111]:
df4=pd.DataFrame({"disc":["Your career goals, personal interests, and how far you want to take your education will all influence your decision of which field is best for you. Computer science takes a broader approach to computing, requiring the acquisition of a diverse set of skills. This gives it one great advantage over a data science degree: a broader range of career possibilities. A data science degree, on the other hand, can be a definite advantage for those engaged in data science careers.  ","shivank ","tanya"]})

In [113]:
df4

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          disc
0  Your career goals, personal interests, and how far you want to take your education will all influence your decision of which field is best for you. Computer science takes a broader approach to computing, requiring the acquisition of a diverse set of skills. This gives it one great advantage over a data science degree: a broader range of career possibilities. A data science degree, on the other hand, can be a definite advantage for those engaged in data science careers.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     shivank
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        tanya

In [114]:
pd.set_option("display.max_colwidth" , 1000)
df4

                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          disc
0  Your career goals, personal interests, and how far you want to take your education will all influence your decision of which field is best for you. Computer science takes a broader approach to computing, requiring the acquisition of a diverse set of skills. This gives it one great advantage over a data science degree: a broader range of career possibilities. A data science degree, on the other hand, can be a definite advantage for those engaged in data science careers.
1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     shivank
2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        tanya

In [107]:
df5["world_count"]=df5['0']

KeyError: '0'

In [102]:
pd.set_option("display.max_colwidth" , 1000)
df3 = pd.DataFrame({"desc": ["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.","my name is sudh" , "i use to take data science mastes class"]})

In [95]:
df3['char_len_data'] = df3['desc'].apply(len)

In [96]:
df3

,desc,char_len_data
0,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets. This trending program provides students with the statistical, mathematical and computational skills needed to meet the large-scale data science challenges of today's professional world. You will learn all the stack required to work in data science industry including cloud infrastructure and real-time industry projects. This course will be taught in Hindi language.",765
1,my name is sudh,15
2,i use to take data science mastes class,39